In [16]:
import pandas as pd
import numpy as np

In [17]:
df = pd.read_csv("stud.csv")
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [18]:
df.loc[2:5, 'name']

2     aniket
3    ajinkya
4       asha
5     ayesha
Name: name, dtype: object

In [19]:
type(df.loc[2:5, 'name'])

pandas.core.series.Series

In [20]:
df.loc[2:5, ['roll','name']]

   roll     name
2     3   aniket
3     4  ajinkya
4     5     asha
5     6   ayesha

In [21]:
df.loc[:, 'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [22]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [23]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [24]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [25]:
df.drop(3)
# 3, 4, 7

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19
4     5    asha    TE  63.28   20
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [26]:
df.drop([3,4,7])

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [27]:
df.drop('class', axis=1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [28]:
# functions

In [29]:
max(df['marks'])

78.66

In [30]:
min(df['roll'])

1

In [31]:
# methods on series

In [32]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [33]:
df['name'].str.startswith('an')

0     True
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: name, dtype: bool

In [34]:
df['name'].str.endswith('an')

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: name, dtype: bool

In [35]:
df['marks'].max()

np.float64(78.66)

In [36]:
df['marks'].std()

np.float64(9.207178901994535)

In [37]:
df['roll']=df['roll']+100
print(df)

   roll     name class  marks  age
0   101     anil    TE  56.77   22
1   102     amit    TE  59.77   21
2   103   aniket    BE  76.88   19
3   104  ajinkya    TE  69.66   20
4   105     asha    TE  63.28   20
5   106   ayesha    BE  49.55   20
6   107     amar    BE  65.34   19
7   108    amita    BE  68.33   23
8   109     amol    TE  56.75   20
9   110    anmol    BE  78.66   21

In [38]:
gender=['m','m','m','f','f','m','f','m','m','m']
df['gender'] = gender
print(df)

   roll     name class  marks  age gender
0     1     anil    TE  56.77   22      m
1     2     amit    TE  59.77   21      m
2     3   aniket    BE  76.88   19      m
3     4  ajinkya    TE  69.66   20      f
4     5     asha    TE  63.28   20      f
5     6   ayesha    BE  49.55   20      m
6     7     amar    BE  65.34   19      f
7     8    amita    BE  68.33   23      m
8     9     amol    TE  56.75   20      m
9    10    anmol    BE  78.66   21      m

In [39]:
#cgpa = [x / 10 + 1.5 for x in df['marks']]
df['cgpa']=df['marks']/10+0.5
print(df)

   roll     name class  marks  age gender   cgpa
0     1     anil    TE  56.77   22      m  6.177
1     2     amit    TE  59.77   21      m  6.477
2     3   aniket    BE  76.88   19      m  8.188
3     4  ajinkya    TE  69.66   20      f  7.466
4     5     asha    TE  63.28   20      f  6.828
5     6   ayesha    BE  49.55   20      m  5.455
6     7     amar    BE  65.34   19      f  7.034
7     8    amita    BE  68.33   23      m  7.333
8     9     amol    TE  56.75   20      m  6.175
9    10    anmol    BE  78.66   21      m  8.366

Delete the gender and cgpa from df 
create new dataframe -> newdf
columns -> roll ,gender, cgpa
where the roll values are same as in df

In [40]:
df.drop(['gender','cgpa'],axis = 1,inplace = True)   #inplace means whatever the changes made that are actually done on the dataframe 
print(df)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [ ]:
newdf = pd.DataFrame(
    {
        'roll': df['roll'],
        'Gender': gender,
        'CGPA':df['marks']/10 +0.5
    })
newdf

   Roll Gender   CGPA
0     1      m  6.177
1     2      m  6.477
2     3      m  8.188
3     4      f  7.466
4     5      f  6.828
5     6      m  5.455
6     7      f  7.034
7     8      m  7.333
8     9      m  6.175
9    10      m  8.366

In [191]:
df.merge(newdf, on='roll')

   roll     name class  marks  age Gender   CGPA
0   101     anil    TE  56.77   22      m  6.177
1   102     amit    TE  59.77   21      m  6.477
2   103   aniket    BE  76.88   19      m  8.188
3   104  ajinkya    TE  69.66   20      f  7.466
4   105     asha    TE  63.28   20      f  6.828
5   106   ayesha    BE  49.55   20      m  5.455
6   107     amar    BE  65.34   19      f  7.034
7   108    amita    BE  68.33   23      m  7.333
8   109     amol    TE  56.75   20      m  6.175
9   110    anmol    BE  78.66   21      m  8.366

In [189]:
x =df[(df['marks']>60) & (df['class']=='BE')] 
x

   roll    name class  marks  age
2   103  aniket    BE  76.88   19
6   107    amar    BE  65.34   19
7   108   amita    BE  68.33   23
9   110   anmol    BE  78.66   21

In [193]:
x.to_csv("stud_data.csv",index = False)    #Create a file using the filtered data .